<!-- terraform-plan-comment -->
### 📦 Terraform Plan Result
```
module.lambda_trigger.data.archive_file.join_trigger_zip: Reading...
module.lambda_trigger.data.archive_file.join_trigger_zip: Read complete after 0s [id=944430d003963720d1934ccef4f12a8ccc35f8eb]
module.lambda_trigger.aws_cloudwatch_event_rule.s3_trigger: Refreshing state... [id=trigger-worker-join]
module.worker_node_iam.aws_iam_role.master_node_ec2: Refreshing state... [id=worker-node-role]
aws_vpc.k8s: Refreshing state... [id=vpc-086e52a33a864ff2e]
module.lambda_trigger_iam.aws_iam_role.master_node_ec2: Refreshing state... [id=lambda-trigger-role]
data.aws_availability_zones.available: Reading...
module.master_node_iam.aws_iam_role.master_node_ec2: Refreshing state... [id=master-node-role]
module.bootstrap_bucket.aws_s3_bucket.worker_node_token: Refreshing state... [id=k8s-bootstrap-artifacts]
data.aws_availability_zones.available: Read complete after 1s [id=us-east-1]
module.bootstrap_bucket.aws_s3_bucket_public_access_block.worker_node_token_access: Refreshing state... [id=k8s-bootstrap-artifacts]
module.lambda_trigger_iam.aws_iam_instance_profile.master_node_ec2_instance_profile: Refreshing state... [id=lambda-trigger-role-profile]
module.master_node_iam.aws_iam_role_policy.master_node_ec2_policy: Refreshing state... [id=master-node-role:MasterNodePolicy]
module.lambda_trigger_iam.aws_iam_role_policy.master_node_ec2_policy: Refreshing state... [id=lambda-trigger-role:LambdaTriggerPolicy]
module.master_node_iam.aws_iam_instance_profile.master_node_ec2_instance_profile: Refreshing state... [id=master-node-role-profile]
module.lambda_trigger.aws_lambda_function.join_trigger: Refreshing state... [id=trigger-worker-join]
module.worker_node_iam.aws_iam_role_policy.master_node_ec2_policy: Refreshing state... [id=worker-node-role:WorkerNodePolicy]
module.worker_node_iam.aws_iam_instance_profile.master_node_ec2_instance_profile: Refreshing state... [id=worker-node-role-profile]
aws_internet_gateway.k8s: Refreshing state... [id=igw-02524fe0cc2fa7c0a]
aws_subnet.public[2]: Refreshing state... [id=subnet-0e00b538d8010a536]
aws_subnet.public[0]: Refreshing state... [id=subnet-03db3655b617f6817]
aws_subnet.public[1]: Refreshing state... [id=subnet-091c91645e010625b]
aws_security_group.k8s: Refreshing state... [id=sg-01bf9bc28bfba67cd]
aws_route_table.k8s: Refreshing state... [id=rtb-0bd02e70a9a3f5884]
module.lambda_trigger.aws_lambda_permission.allow_eventbridge: Refreshing state... [id=AllowExecutionFromEventBridge]
module.lambda_trigger.aws_cloudwatch_event_target.lambda_target: Refreshing state... [id=trigger-worker-join-TriggerLambda]
aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-09cd4354b96a4dbdd]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0d3b36ef6c734995b]
aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-07b4e6a9230757cb9]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.master.aws_instance.cluster_ec2[0] will be created
  + resource "aws_instance" "cluster_ec2" {
      + ami                                  = "ami-020cba7c55df1f615"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "master-node-role-profile"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "test_key_demo"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = "subnet-03db3655b617f6817"
      + tags                                 = {
          + "Name" = "k8s-master"
          + "Role" = "master-node"
        }
      + tags_all                             = {
          + "Name" = "k8s-master"
          + "Role" = "master-node"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "68f8fe3032142ec775d3bf3012f2e7170aeaf445"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-01bf9bc28bfba67cd",
        ]
    }

  # module.worker1.aws_instance.cluster_ec2[0] will be created
  + resource "aws_instance" "cluster_ec2" {
      + ami                                  = "ami-020cba7c55df1f615"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "test_key_demo"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = "subnet-091c91645e010625b"
      + tags                                 = {
          + "Name" = "k8s-worker-1"
          + "Role" = "worker-node"
        }
      + tags_all                             = {
          + "Name" = "k8s-worker-1"
          + "Role" = "worker-node"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "68f8fe3032142ec775d3bf3012f2e7170aeaf445"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-01bf9bc28bfba67cd",
        ]
    }

  # module.worker2.aws_instance.cluster_ec2[0] will be created
  + resource "aws_instance" "cluster_ec2" {
      + ami                                  = "ami-020cba7c55df1f615"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "test_key_demo"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = "subnet-0e00b538d8010a536"
      + tags                                 = {
          + "Name" = "k8s-worker-2"
          + "Role" = "worker-node"
        }
      + tags_all                             = {
          + "Name" = "k8s-worker-2"
          + "Role" = "worker-node"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "68f8fe3032142ec775d3bf3012f2e7170aeaf445"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-01bf9bc28bfba67cd",
        ]
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.binary

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.binary"

```